EA/src/Documents/ВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.МестаЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыДляВозвратов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПродажи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСмены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RRN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>authcode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/МестаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>МестаЗаказов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приемка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Раскладка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутНаАптеку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/Enums/ТорговыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТорговыеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Documents/МаршрутНаАптеку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>МаршрутНаАптеку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МестаЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоробкиСборки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коробка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Documents/ВводНачальныхОстатков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Узел = ПланыОбмена.ПланОбменаОбновлениями.НайтиПоРеквизиту("АдресХранения",АдресХранения);
	Если ЗначениеЗаполнено(Узел) тогда
		Префикс = Узел.Префикс;
	Иначе
		Префикс = "";
	КонецЕсли;
	УзелОбменДанными = ПланыОбмена.ПланОбменаДанными.НайтиПоРеквизиту("ОсновнойУзел",Узел);
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.МестаЗаказов.Очистить();
	Движения.МестаЗаказов.Записывать = Истина;
	Для каждого строка из Остатки цикл
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение,Строка);
	КонецЦикла;
	ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменДанными,Движения.ОстаткиТовара);
	//Для каждого строка из Заказы цикл
	//	Движение = Движения.МестаЗаказов.ДобавитьПриход();
	//	Движение.Период = Дата;
	//	Движение.Заказ = Строка.Заказ;
	//	Движение.МестоЗаказа = Строка.МестоЗаказа;
	//	Движение.Раскладка = Строка.Количество;		
	//КонецЦикла;
	//ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменДанными,Движения.МестаЗаказов);
	Склад = АдресХранения.ОсновнойСклад;
	Организация = АдресХранения.Фирма;
	Для каждого строка из ЗаказыДляВозвратов цикл
		Чек = Документы.Чеки.СоздатьДокумент();
		Чек.Организация = Организация;
		Чек.Дата = Строка.ДатаПродажи;
		ЗаполнитьЗначенияСвойств(Чек,Строка);
		Если ЗначениеЗаполнено(Строка.RRN) тогда
			Чек.ОплатаПоКарте = Истина;
		КонецЕсли;
		Чек.Отдел = Склад;
		Чек.ДокументОснование = Строка.Заказ;
		Чек.ТипЦены =  Строка.Заказ.ТипЦены;
		Для каждого строкаЗаказ из Строка.Заказ.Товар цикл
			СтрокаЧек = Чек.Реализация.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЧек,строкаЗаказ);
			СтрокаЧек.Операц = Перечисления.ТорговыеОперации.Продажа;
		КонецЦикла;
		Чек.УстановитьНовыйНомер(Префикс);
		Чек.ОбменДанными.Загрузка = Истина;
		Чек.Записать(РежимЗаписиДокумента.Запись);
		Чек.ОбменДанными.Загрузка = Ложь;
		Чек.Записать(РежимЗаписиДокумента.Проведение);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменДанными,Чек);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменДанными,Чек.Движения.ОстаткиТовара);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменДанными,Чек.Движения.Реализация);
	КонецЦикла;
	СоздатьМаршрутНаАптекуНачальныеОстатки();
КонецПроцедуры

Процедура СоздатьМаршрутНаАптекуНачальныеОстатки() Экспорт
	Если Заказы.Количество() = 0 тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутНаАптеку.Ссылка
	|ИЗ
	|	Документ.МаршрутНаАптеку КАК МаршрутНаАптеку
	|ГДЕ
	|	МаршрутНаАптеку.ДокументОснование = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			ДокМаршрут = Выборка.Ссылка.ПолучитьОбъект();
		КонецЦикла;
	Иначе
		ДокМаршрут = Документы.МаршрутНаАптеку.СоздатьДокумент();
	КонецЕсли;
	
	ДокМаршрут.АдресХранения = АдресХранения;
	ДокМаршрут.ДокументОснование = Ссылка;
	ДокМаршрут.НомерДокументаОснования = "111111";
	ДокМаршрут.Дата = НачалоДня(Дата);
	Для каждого строка из Заказы цикл
		СтрокаСостав = ДокМаршрут.Состав.Добавить();
		СтрокаСостав.Заказ = Строка.Заказ;
		СтрокаСостав.МестоЗаказа = Строка.МестоЗаказа;
	КонецЦикла;	
	ДокМаршрут.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
